› 19.01.2022:

Добавили сообщение на весь сервер, когда кто-то голосует за сервер на сайте.

Исправили шаблон сайта на устройстве Windows 10, теперь никаких ошибок не должно быть.

Теперь мониторинг не будет отображаться если сервер оффлайн.

На данный момент по оплате "СБП" ведутся тех работы.

Когда будут доступны мобильные платежи для покупки?

× Сроки не известны.


На сервере теперь стало приятнее играть, также код выполняется в 2х быстрее!

Устранили код, которые брал очень много ОЗУ.

Добавили в бар отображение пинга.
Теперь в режиме "Скрытые префикса" после выхода он не будет сбрасываться.

› 20.01.2022:

Теперь разрешено использовать пробелы в нике для доната.

› 21.01.2022:

На сайте добавлен пресс-бар онлайна, чем выше онлайн — тем выше ползунок.

Генерация:
Обновлена генерация, теперь она ещё красивее! Доработали горы также океаны и реки намного больше.
Новый биом — БОЛОТО!

Добавили новые предметы в /shop: 'Костная мука', 'Семена', 'Торт', 'Хлеб', 'Перо'.

Удалили 1 мини-игру и это "Крестики-нолики". В связи с многими багами — мы её убрали на доработку!

› 23.01.2022:

Добавлена защита от ников, которые имеют проблемы.

Добавлена защита от ников, которые имеют ****


› 24.01.2022:

Добавлена задержка на некоторые команды.


› 25.01.2022:

Исправлена защита от фейк /nick которые могли использовать главные буквы для обхода ника игрока.

Добавлена возможность оплаты по "МегаФон"!

Восстановлен приём платежей через СБП


› 26.01.2022:

Временно не работают "Последние покупки".
