› 19.01.2022:

Добавили сообщение на весь сервер, когда кто-то голосует за сервер на сайте.

Исправили шаблон сайта на устройстве Windows 10, теперь никаких ошибок не должно быть.

Теперь мониторинг не будет отображаться если сервер оффлайн.

На данный момент по оплате "СБП" ведутся тех работы.

Когда будут доступны мобильные платежи для покупки?

× Сроки не известны.


На сервере теперь стало приятнее играть, также код выполняется в 2х быстрее!

Устранили код, которые брал очень много ОЗУ.

Добавили в бар отображение пинга.
Теперь в режиме "Скрытые префикса" после выхода он не будет сбрасываться.

› 20.01.2022:

Теперь разрешено использовать пробелы в нике для доната.
